// Задание
// Дополни код объявления объекта так, чтобы у него были свойства name, price, image
//  и tags со значениями из переменных с аналогичными именами. Обязательно используй синтаксис
//   коротких свойств.

// Тесты
// Объявлена переменная product.
// Значение переменной product это объект.
// Значение вложенного свойства name это строка 'Ремонтный дроид'.
// Значение вложенного свойства price это число 2500.
// Значение вложенного свойства image это строка 'https://via.placeholder.com/640x480'.
// Значение вложенного свойства tags это массив ['on sale', 'trending', 'best buy'].

const name = 'Ремонтный дроид';
const price = 2500;
const image = 'https://via.placeholder.com/640x480';
const tags = ['on sale', 'trending', 'best buy'];

const product = {
  // Пиши код ниже этой строки
  name,
  price,
  image,
  tags,


  // Пиши код выше этой строки
};
console.table(product);

