// Задание
// В переменной scores хранится массив результатов тестирования. Используя
//  распыление и методы Math.max() и Math.min() дополни код так, чтобы в переменной
//   bestScore был самый высокий балл, а в worstScore самый низкий.

// Тесты
// Объявлена переменная scores.
// Значение переменной scores это массив [89, 64, 42, 17, 93, 51, 26].
// Объявлена переменная bestScore.
// Значение переменной bestScore это число 93.
// Объявлена переменная worstScore.
// Значение переменной worstScore это число 17.
// Для передачи аргументов методу Math.max() используется синтаксис ... на массиве scores.
// Для передачи аргументов методу Math.min() используется синтаксис ... на массиве scores.

const scores = [89, 64, 42, 17, 93, 51, 26];
// Пиши код ниже этой строки
const bestScore = Math.max(...scores);
const worstScore = Math.min(...scores);

console.log(bestScore);
console.log(worstScore);